## 판다스?

테이터프레임(엑셀과 비슷) 과 시리즈라는 자료형  
데이터 분석을 위한 다양한 기능을 제공하는 라이브러리  
R의 데이터프레임에 영향  
내부적으로 numpy 를 사용하므로 함께 import  

http://pandas.pydata.org

기능요약  
https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf

In [2]:
x = [1,2,3,4,5]
# x[::-1]
x.reverse()
# reversed(x)

In [3]:
x

[5, 4, 3, 2, 1]

In [5]:
print(list(reversed(x)))
print(x)

[1, 2, 3, 4, 5]
[5, 4, 3, 2, 1]

In [7]:
# sort
print(x)
x.sort()

[5, 4, 3, 2, 1]

In [19]:
temp = [[0, 3], [3, 6], [7, 2]]

In [21]:
sorted(temp, key=lambda i: i[1])

[[7, 2], [0, 3], [3, 6]]

In [ ]:
sorted(temp_dict.values())

In [11]:
sorted(x)

[1, 2, 3, 4, 5]

# Series

In [17]:
import pandas as pd
import numpy as np

In [22]:
x = [1, 2, 3, 4, 5]
pd.Series(x)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [23]:
x = np.array([1, 2, 3, 4, 5])
pd.Series(x)

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [34]:
x = [1, 2, 3, 4, 5]
x = pd.Series(x)
y = [6, 7, 8, 9, 10]
y = pd.Series(y)

# print(x[0])
# print(x[1: 3])
# print(x[::-1])
# print(x[x > 3])
# print(x + 1)
# print(x * 10)
print(x + y)

0     7
1     9
2    11
3    13
4    15
dtype: int64

# Series Index

In [37]:
import pandas as pd
import numpy as np

x = [1, 2, 3, 4, 5]
x = pd.Series(x)
print(x.index)
print(x.values)

RangeIndex(start=0, stop=5, step=1)
[1 2 3 4 5]

In [43]:
x = [1, 2, 3, 4, 5]
x = pd.Series(x, index=['a','b','c','d','e']) #인덱스설정
print(x)

# print(x['a']) #명시적 인덱스접근
# print(x[0]) #묵시적 인덱스접근
# print(x[['a','e']]) #팬시색인, 한번에 여러값 접근
print(x.a)

a    1
b    2
c    3
d    4
e    5
dtype: int64
1

In [49]:
x = [1, 2, 3, 4, 5]
x = pd.Series(x, index=[1, 2, 3, 4, 5])
print(x)
# x[0] # 오류
# print(x.iloc[2]) #묵시적 인덱스로만
print(x.loc[3]) #명시적 인덱스로만

1    1
2    2
3    3
4    4
5    5
dtype: int64
3

## 딕셔너리 to Series

In [50]:
x = {"수학":90, "영어":80, "과학":95, "미술":80}
x = pd.Series(x)
x

수학    90
영어    80
과학    95
미술    80
dtype: int64

In [51]:
print(x['수학'])

90

In [52]:
print(x['영어':])

영어    80
과학    95
미술    80
dtype: int64

In [54]:
x = {"수학":90, "영어":80, "과학":95, "미술":80}
x = pd.Series(x, index=["수학", "영어", "과학"])
x

수학    90
과학    95
dtype: int64

## Multi Index

In [55]:
student_1 = {"수학":90, "영어":80, "과학":95, "미술":80}
student_2 = {"수학":70, "영어":90, "과학":100, "미술":70}

In [57]:
list(range(len(student_1)))

[0, 1, 2, 3]

In [60]:
['홍길동' for i in range(len(student_1))] + ['이몽룡' for i in range(len(student_2))]

['홍길동', '홍길동', '홍길동', '홍길동', '이몽룡', '이몽룡', '이몽룡', '이몽룡']

In [62]:
[key for key in student_1] + [i for i in student_2]

['수학', '영어', '과학', '미술', '수학', '영어', '과학', '미술']

In [63]:
#index_1 = ['홍길동','홍길동','홍길동','홍길동','이몽룡','이몽룡','이몽룡','이몽룡']
index_1 = ['홍길동' for i in range(len(student_1))] + ['이몽룡' for i in range(len(student_2))]

#index_2 = ['수학','영어','과학','미술','수학','영어','과학','미술']
index_2 = [i for i in student_1] + [i for i in student_2]

In [67]:
value_all = list(student_1.values()) + list(student_2.values())

In [68]:
students = pd.Series(value_all, index=[index_1, index_2])
students

홍길동  수학     90
     영어     80
     과학     95
     미술     80
이몽룡  수학     70
     영어     90
     과학    100
     미술     70
dtype: int64

In [69]:
students['홍길동']

수학    90
영어    80
과학    95
미술    80
dtype: int64

In [70]:
students['이몽룡']

수학     70
영어     90
과학    100
미술     70
dtype: int64

## 결측값 처리방법 (NaN. None)

In [71]:
x = [1, None, 2, None, 3, 4, None]
x = pd.Series(x)
x

0    1.0
1    NaN
2    2.0
3    NaN
4    3.0
5    4.0
6    NaN
dtype: float64

In [72]:
print(x.sum())
print(x.max())
print(x.min())

10.0
4.0
1.0

In [74]:
# 결측값 갯수
print(x.isnull())
print(x.isnull().sum())

0    False
1     True
2    False
3     True
4    False
5    False
6     True
dtype: bool
3

In [76]:
x.notnull().sum()

4

In [79]:
#결측값 제거
print(x.dropna())

0    1.0
2    2.0
4    3.0
5    4.0
dtype: float64

In [80]:
#결측값을 다른값으로 채우기
x.fillna(0)

0    1.0
1    0.0
2    2.0
3    0.0
4    3.0
5    4.0
6    0.0
dtype: float64

## concat

In [81]:
x = pd.Series([1, 2, 3])
y = pd.Series([4, 5, 6])
z = pd.Series([7, 8, 9])

pd.concat([x, y, z])

0    1
1    2
2    3
0    4
1    5
2    6
0    7
1    8
2    9
dtype: int64

In [82]:
pd.concat([x, y, z], verify_integrity=True) #같은 값의 인덱스가 있을경우 오류

ValueError: Indexes have overlapping values: Int64Index([0, 1, 2], dtype='int64')

In [84]:
pd.concat([x, y, z], ignore_index=True)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [85]:
pd.concat([x, y, z], verify_integrity=False, ignore_index=True, axis=1)

   0  1  2
0  1  4  7
1  2  5  8
2  3  6  9

In [86]:
x = pd.Series([1, 2, 3, 4])
y = pd.Series([4, 5, 6])
z = pd.Series([7, 8, 9])

In [87]:
pd.concat([x, y, z], verify_integrity=False, ignore_index=True, axis=1, join='inner')

   0  1  2
0  1  4  7
1  2  5  8
2  3  6  9

In [88]:
pd.concat([x, y, z], verify_integrity=False, ignore_index=True, axis=1, join='outer')

   0    1    2
0  1  4.0  7.0
1  2  5.0  8.0
2  3  6.0  9.0
3  4  NaN  NaN

## 연산과 집계함수

In [89]:
x = pd.Series([1, 2, 3, 4, 5])
y = pd.Series([6, 7, 8, 9, 0])

In [91]:
#더하기
print(x.add(10))
print(x.add(y))

0    11
1    12
2    13
3    14
4    15
dtype: int64
0     7
1     9
2    11
3    13
4     5
dtype: int64

In [92]:
#빼기
print(x.sub(y))

0   -5
1   -5
2   -5
3   -5
4    5
dtype: int64

In [93]:
#곱하기
print(x.mul(y))

0     6
1    14
2    24
3    36
4     0
dtype: int64

In [94]:
#나누기
print(x.floordiv(2))
print(x.div(2))
print(x.mod(2))

0    0
1    1
2    1
3    2
4    2
dtype: int64
0    0.5
1    1.0
2    1.5
3    2.0
4    2.5
dtype: float64
0    1
1    0
2    1
3    0
4    1
dtype: int64

In [95]:
#제곱
print(x.pow(2))

0     1
1     4
2     9
3    16
4    25
dtype: int64

In [96]:
#기초통계
print(x.count())
print(x.min())
print(x.max())
print(x.mean())
print(x.median()) #중간값
print(x.sum())
print(x.std()) # 표준편차
print(x.var()) # 분산
print(x.mad()) # 절대표준편차
print(x.describe()) #기초통계모두

5
1
5
3.0
3.0
15
1.5811388300841898
2.5
1.2
count    5.000000
mean     3.000000
std      1.581139
min      1.000000
25%      2.000000
50%      3.000000
75%      4.000000
max      5.000000
dtype: float64

In [99]:
print(x.head(2)) #앞의 일부데이터 확인
print(x.tail()) #뒤의 일부데이터 확인

0    1
1    2
dtype: int64
0    1
1    2
2    3
3    4
4    5
dtype: int64

## 실습1

In [1]:
import pandas as pd
import numpy as np

In [12]:
# x배열에서 (0~5 index 중) 임의의 한개 원소를 가져온다.
x[np.random.randint(0,6)]

nan

In [13]:
# List Comprehension을 사용해서 임의로 20개를 선택한 배열을 만든다.
[ x[np.random.randint(0,6)] for i in range(20) ]

[1, 1, 3, 2, 3, 1, 4, 1, 4, 2, nan, 5, 1, 3, 3, 3, 4, nan, nan, 5]

In [2]:
x = [np.nan,1,2,3,4,5]
y = pd.Series( [x[np.random.randint(0,6)] for i in range(20)] )

In [17]:
# 결측값 갯수
null_count = y.isnull().sum()
null_count

1

In [18]:
y.dropna()

0     4.0
1     3.0
2     1.0
3     5.0
4     3.0
5     3.0
6     5.0
7     2.0
8     4.0
9     3.0
10    2.0
11    3.0
12    5.0
13    1.0
14    3.0
16    2.0
17    3.0
18    5.0
19    3.0
dtype: float64

In [21]:
# 1. 평균값
y_mean = y.mean()
y_mean

3.1578947368421053

In [22]:
# 2. 결측값에 채워준다
y.fillna(y_mean)

0     4.000000
1     3.000000
2     1.000000
3     5.000000
4     3.000000
5     3.000000
6     5.000000
7     2.000000
8     4.000000
9     3.000000
10    2.000000
11    3.000000
12    5.000000
13    1.000000
14    3.000000
15    3.157895
16    2.000000
17    3.000000
18    5.000000
19    3.000000
dtype: float64

# DataFrame

In [100]:
sales_data = {    
    '연도':[2015, 2016, 2017, 2018, 2019, 2020],
    '판매량':[103, 70, 130, 160, 190, 230],
    '매출':[500000, 300000, 400000, 550000, 700000, 680000],
    '순이익':[370000, 190000, 300000, 480000, 600000, 590000]
}

sales_data = pd.DataFrame(sales_data)
sales_data

     연도  판매량      매출     순이익
0  2015  103  500000  370000
1  2016   70  300000  190000
2  2017  130  400000  300000
3  2018  160  550000  480000
4  2019  190  700000  600000
5  2020  230  680000  590000

In [101]:
sales_data['판매량']

0    103
1     70
2    130
3    160
4    190
5    230
Name: 판매량, dtype: int64

In [102]:
sales_data.iloc[1]

연도       2016
판매량        70
매출     300000
순이익    190000
Name: 1, dtype: int64

In [106]:
sales_data = {    
    '연도':[2015, 2016, 2017, 2018, 2019, 2020],
    '판매량':[103, 70, 130, 160, 190, 230],
    '매출':[500000, 300000, 400000, 550000, 700000, 680000],
    '순이익':[370000, 190000, 300000, 480000, 600000, 590000]
}

temp_df = pd.DataFrame(sales_data, columns=['판매량','매출','순이익'], index=sales_data['연도'])
temp_df

      판매량      매출     순이익
2015  103  500000  370000
2016   70  300000  190000
2017  130  400000  300000
2018  160  550000  480000
2019  190  700000  600000
2020  230  680000  590000

In [109]:
print(temp_df.loc[2017])
print(temp_df.iloc[2])

판매량       130
매출     400000
순이익    300000
Name: 2017, dtype: int64
판매량       130
매출     400000
순이익    300000
Name: 2017, dtype: int64

## 파일생성

In [ ]:
%%writefile sales_data.csv
연도,판매량,매출,순이익
2015,103,500000,370000
2016,70,300000,190000
2017,130,400000,300000
2018,60,550000,480000
2019,190,700000,600000
2020,230,680000,590000

## CSV 파일읽기

In [113]:
sales_data = pd.read_csv('sales_data.csv', index_col='연도', header=0, sep='\t')
sales_data

      판매량       매출      순이익
연도
2015  103  500,000  370,000
2016   70  300,000  190,000
2017  130  400,000  300,000
2018   60  550,000  480,000
2019  190  700,000  600,000
2020  230  680,000  590,000

## CSV 파일쓰기

In [114]:
sales_data.to_csv('sales_data_save.csv', encoding='utf-8-sig')

In [123]:
pd.read_csv('sales_data_save.csv', header=0)

           연도  판매량   매출  순이익
2015 103  500    0  370    0
2016 70   300    0  190    0
2017 130  400    0  300    0
2018 60   550    0  480    0
2019 190  700    0  600    0
2020 230  680    0  590    0

## 데이터 추가

In [124]:
sales_data = {    
    '연도':[2015, 2016, 2017, 2018, 2019, 2020],
    '판매량':[103, 70, 130, 160, 190, 230],
    '매출':[500000, 300000, 400000, 550000, 700000, 680000],
    '순이익':[370000, 190000, 300000, 480000, 600000, 590000]
}

sales_data = pd.DataFrame(sales_data)
sales_data

     연도  판매량      매출     순이익
0  2015  103  500000  370000
1  2016   70  300000  190000
2  2017  130  400000  300000
3  2018  160  550000  480000
4  2019  190  700000  600000
5  2020  230  680000  590000

In [129]:
sales_data['순이익율'] = (sales_data['순이익']/sales_data['매출']) * 100
sales_data

     연도  판매량      매출     순이익       순이익율
0  2015  103  500000  370000  74.000000
1  2016   70  300000  190000  63.333333
2  2017  130  400000  300000  75.000000
3  2018  160  550000  480000  87.272727
4  2019  190  700000  600000  85.714286
5  2020  230  680000  590000  86.764706

In [131]:
def check(n):
    if n > 80:
        return '높음'
    else:
        return '낮음'

In [132]:
sales_data['순이익율'].apply(check)

0    낮음
1    낮음
2    낮음
3    높음
4    높음
5    높음
Name: 순이익율, dtype: object

In [133]:
sales_data['순이익율_비교'] = sales_data['순이익율'].apply(check)
# 조건 표현식 : True_Value if 조건 else False_Value
#sales_data['순이익율_비교'] = sales_data['순이익율'].apply(lambda n: '높음' if n > 80 else '낮음')
sales_data

     연도  판매량      매출     순이익       순이익율 순이익율_비교
0  2015  103  500000  370000  74.000000      낮음
1  2016   70  300000  190000  63.333333      낮음
2  2017  130  400000  300000  75.000000      낮음
3  2018  160  550000  480000  87.272727      높음
4  2019  190  700000  600000  85.714286      높음
5  2020  230  680000  590000  86.764706      높음

## 데이터 추가 2

In [134]:
sales_data = {    
    '연도':[2015, 2016, 2017, 2018, 2019, 2020],
    '판매량':[103, 70, 130, 160, 190, 230],
    '매출':[500000, 300000, 400000, 550000, 700000, 680000],
    '순이익':[370000, 190000, 300000, 480000, 600000, 590000]
}

sales_data = pd.DataFrame(sales_data)
sales_data

     연도  판매량      매출     순이익
0  2015  103  500000  370000
1  2016   70  300000  190000
2  2017  130  400000  300000
3  2018  160  550000  480000
4  2019  190  700000  600000
5  2020  230  680000  590000

In [136]:
sales_data[sales_data['매출'] > 300000]

     연도  판매량      매출     순이익
0  2015  103  500000  370000
2  2017  130  400000  300000
3  2018  160  550000  480000
4  2019  190  700000  600000
5  2020  230  680000  590000

In [138]:
np.where(sales_data['판매량'] > 200, 0, sales_data['판매량'])

array([103,  70, 130, 160, 190,   0], dtype=int64)

In [139]:
sales_data['테스트1'] = np.where(sales_data['판매량'] > 200, 0, sales_data['판매량'])
sales_data

     연도  판매량      매출     순이익  테스트1
0  2015  103  500000  370000   103
1  2016   70  300000  190000    70
2  2017  130  400000  300000   130
3  2018  160  550000  480000   160
4  2019  190  700000  600000   190
5  2020  230  680000  590000     0

In [140]:
sales_data['판매량'].apply(lambda x : 0 if x > 200 else x)

0    103
1     70
2    130
3    160
4    190
5      0
Name: 판매량, dtype: int64

In [144]:
sales_data[sales_data['판매량'] < 100]['판매량'] + 50

1    120
Name: 판매량, dtype: int64

In [145]:
sales_data['테스트2'] = sales_data[sales_data['판매량'] < 100]['판매량'] + 50
sales_data

     연도  판매량      매출     순이익  테스트1   테스트2
0  2015  103  500000  370000   103    NaN
1  2016   70  300000  190000    70  120.0
2  2017  130  400000  300000   130    NaN
3  2018  160  550000  480000   160    NaN
4  2019  190  700000  600000   190    NaN
5  2020  230  680000  590000     0    NaN

In [147]:
sales_data.loc[6] = [2021, 720000,650000, 360, 0, 0]
sales_data

     연도     판매량      매출     순이익  테스트1   테스트2
0  2015     103  500000  370000   103    NaN
1  2016      70  300000  190000    70  120.0
2  2017     130  400000  300000   130    NaN
3  2018     160  550000  480000   160    NaN
4  2019     190  700000  600000   190    NaN
5  2020     230  680000  590000     0    NaN
6  2021  720000  650000     360     0    0.0

In [148]:
sales_data.loc[7] = sales_data.loc[5] + 100
sales_data

       연도       판매량        매출       순이익   테스트1   테스트2
0  2015.0     103.0  500000.0  370000.0  103.0    NaN
1  2016.0      70.0  300000.0  190000.0   70.0  120.0
2  2017.0     130.0  400000.0  300000.0  130.0    NaN
3  2018.0     160.0  550000.0  480000.0  160.0    NaN
4  2019.0     190.0  700000.0  600000.0  190.0    NaN
5  2020.0     230.0  680000.0  590000.0    0.0    NaN
6  2021.0  720000.0  650000.0     360.0    0.0    0.0
7  2120.0     330.0  680100.0  590100.0  100.0    NaN

## 데이터 삭제

In [149]:
sales_data = {    
    '연도':[2015, 2016, 2017, 2018, 2019, 2020],
    '판매량':[103, 70, 130, 160, 190, 230],
    '매출':[500000, 300000, 400000, 550000, 700000, 680000],
    '순이익':[370000, 190000, 300000, 480000, 600000, 590000]
}

sales_data = pd.DataFrame(sales_data)
sales_data['테스트1'] = 'test1'
sales_data['테스트2'] = 'test2'
sales_data['테스트3'] = 'test3'

sales_data

     연도  판매량      매출     순이익   테스트1   테스트2   테스트3
0  2015  103  500000  370000  test1  test2  test3
1  2016   70  300000  190000  test1  test2  test3
2  2017  130  400000  300000  test1  test2  test3
3  2018  160  550000  480000  test1  test2  test3
4  2019  190  700000  600000  test1  test2  test3
5  2020  230  680000  590000  test1  test2  test3

In [150]:
del sales_data['테스트1']
sales_data

     연도  판매량      매출     순이익   테스트2   테스트3
0  2015  103  500000  370000  test2  test3
1  2016   70  300000  190000  test2  test3
2  2017  130  400000  300000  test2  test3
3  2018  160  550000  480000  test2  test3
4  2019  190  700000  600000  test2  test3
5  2020  230  680000  590000  test2  test3

In [151]:
sales_data.drop(['테스트2'], axis='columns', inplace=True)
sales_data

     연도  판매량      매출     순이익   테스트3
0  2015  103  500000  370000  test3
1  2016   70  300000  190000  test3
2  2017  130  400000  300000  test3
3  2018  160  550000  480000  test3
4  2019  190  700000  600000  test3
5  2020  230  680000  590000  test3

In [152]:
sales_data.drop(['테스트3'], axis='columns', inplace=True)
sales_data

     연도  판매량      매출     순이익
0  2015  103  500000  370000
1  2016   70  300000  190000
2  2017  130  400000  300000
3  2018  160  550000  480000
4  2019  190  700000  600000
5  2020  230  680000  590000

In [154]:
sales_data.columns[[0, 2]]

Index(['연도', '매출'], dtype='object')

In [155]:
sales_data.drop(sales_data.columns[[0, 2]], axis='columns', inplace=True)
sales_data

   판매량     순이익
0  103  370000
1   70  190000
2  130  300000
3  160  480000
4  190  600000
5  230  590000

In [156]:
sales_data.drop(0, inplace=True)
sales_data

   판매량     순이익
1   70  190000
2  130  300000
3  160  480000
4  190  600000
5  230  590000

In [157]:
sales_data.drop([3, 4, 5], inplace=True)
sales_data

   판매량     순이익
1   70  190000
2  130  300000

In [159]:
# 인덱스 초기화 후 기존 인덱스 칼럼 삭제
sales_data.reset_index(inplace=True)
sales_data.drop(['index'], axis='columns', inplace=True)

In [162]:
sales_data.drop(sales_data.columns[0], axis='columns')

   판매량     순이익
0   70  190000
1  130  300000

## Dataframe MultiIndex

In [163]:
df = pd.DataFrame(np.random.randint(1, 100, size=(4, 4)), 
    index=[['A','A','B','B'],['a','b','a','b']], 
    columns=[['가가','가가','나나','나나'],['가','나','가','나']])

df

     가가      나나
      가   나   가   나
A a  29   7  16  25
  b  95  10  64  21
B a  19  34  11  63
  b  12  15  27  33

In [164]:
df['가가']

      가   나
A a  29   7
  b  95  10
B a  19  34
  b  12  15

In [165]:
df.loc['A']

   가가      나나
    가   나   가   나
a  29   7  16  25
b  95  10  64  21

In [166]:
df.index

MultiIndex([('A', 'a'),
            ('A', 'b'),
            ('B', 'a'),
            ('B', 'b')],
           )

In [167]:
df.columns

MultiIndex([('가가', '가'),
            ('가가', '나'),
            ('나나', '가'),
            ('나나', '나')],
           )

## GroupBy

In [168]:
df = pd.DataFrame(np.random.randint(1, 100, size=(8, 2)), 
    index=[['A창고','A창고','A창고','A창고','B창고','B창고','B창고','B창고'],
            ['사과','배','바나나','사과','사과','배','바나나','배']], 
    columns=['판매','재고'])
df.index.names = ['창고명','상품명']
df

         판매  재고
창고명 상품명
A창고 사과   17  56
    배     8  51
    바나나  37  63
    사과    4  33
B창고 사과   72  71
    배     5  65
    바나나  22  66
    배    35   2

In [169]:
df.groupby('창고명')

In [170]:
df.groupby('창고명').sum()

      판매   재고
창고명
A창고   66  203
B창고  134  204

In [171]:
df.groupby('창고명').max()

     판매  재고
창고명
A창고  37  63
B창고  72  71

In [175]:
df.groupby('창고명').min()

     판매  재고
창고명
A창고   4  33
B창고   5   2

In [176]:
df.groupby('상품명').sum()

     판매   재고
상품명
바나나  59  129
배    48  118
사과   93  160

In [178]:
df

         판매  재고
창고명 상품명
A창고 사과   17  56
    배     8  51
    바나나  37  63
    사과    4  33
B창고 사과   72  71
    배     5  65
    바나나  22  66
    배    35   2

In [177]:
df.groupby(['창고명','상품명']).sum()

         판매  재고
창고명 상품명
A창고 바나나  37  63
    배     8  51
    사과   21  89
B창고 바나나  22  66
    배    40  67
    사과   72  71

## sort_values

In [179]:
df = pd.DataFrame(np.random.randint(1, 100, size=(8, 2)), 
    index=[['A창고','A창고','A창고','A창고','B창고','B창고','B창고','B창고'],
            ['사과','배','바나나','사과','사과','배','바나나','배']], 
    columns=['판매','재고'])
df

         판매  재고
A창고 사과   14  58
    배    16   6
    바나나  64  82
    사과   88  23
B창고 사과   58  90
    배    93  35
    바나나  17  10
    배    81  82

In [180]:
df.sort_values(by="판매", ascending=True)

         판매  재고
A창고 사과   14  58
    배    16   6
B창고 바나나  17  10
    사과   58  90
A창고 바나나  64  82
B창고 배    81  82
A창고 사과   88  23
B창고 배    93  35

In [183]:
df.loc['A창고', '바나나'] = [81, 79]

C:\Users\SBA8\AppData\Local\Temp\ipykernel_6372\390222344.py:1: PerformanceWarning: indexing past lexsort depth may impact performance.
  df.loc['A창고', '바나나'] = [81, 79]

In [185]:
df.sort_values(by=["판매", "재고"], ascending=[True, False])

         판매  재고
A창고 사과   14  58
    배    16   6
B창고 바나나  17  10
    사과   58  90
    배    81  82
A창고 바나나  81  79
    사과   88  23
B창고 배    93  35

## 실습2

In [25]:
random_matrix = np.random.randint(1, 100, size=(15, 3))
random_matrix

array([[60, 83, 31],
       [ 6, 95, 92],
       [60,  5, 37],
       [62, 52, 31],
       [27,  3, 89],
       [80, 20, 96],
       [12, 26, 12],
       [ 6, 36, 96],
       [87, 99, 37],
       [13, 82, 85],
       [19, 91,  7],
       [73,  8, 79],
       [54, 62, 85],
       [80, 60, 53],
       [58, 69, 37]])

In [27]:
index1 = ['1학년'] * 5 + ['2학년'] * 5 + ['3학년'] * 5
index1

['1학년',
 '1학년',
 '1학년',
 '1학년',
 '1학년',
 '2학년',
 '2학년',
 '2학년',
 '2학년',
 '2학년',
 '3학년',
 '3학년',
 '3학년',
 '3학년',
 '3학년']

In [30]:
index2 = [ f'{i}반' for i in range(1, 6) ] * 3 # str(i)+'반'
index2

['1반',
 '2반',
 '3반',
 '4반',
 '5반',
 '1반',
 '2반',
 '3반',
 '4반',
 '5반',
 '1반',
 '2반',
 '3반',
 '4반',
 '5반']

In [32]:
score_df = pd.DataFrame(random_matrix, columns=['국어', '영어', '과학'], index=[index1, index2])
score_df

        국어  영어  과학
1학년 1반  60  83  31
    2반   6  95  92
    3반  60   5  37
    4반  62  52  31
    5반  27   3  89
2학년 1반  80  20  96
    2반  12  26  12
    3반   6  36  96
    4반  87  99  37
    5반  13  82  85
3학년 1반  19  91   7
    2반  73   8  79
    3반  54  62  85
    4반  80  60  53
    5반  58  69  37

In [33]:
score_df['총점'] = score_df['국어'] + score_df['영어'] + score_df['과학']
score_df

        국어  영어  과학   총점
1학년 1반  60  83  31  174
    2반   6  95  92  193
    3반  60   5  37  102
    4반  62  52  31  145
    5반  27   3  89  119
2학년 1반  80  20  96  196
    2반  12  26  12   50
    3반   6  36  96  138
    4반  87  99  37  223
    5반  13  82  85  180
3학년 1반  19  91   7  117
    2반  73   8  79  160
    3반  54  62  85  201
    4반  80  60  53  193
    5반  58  69  37  164

In [34]:
score_df['평균'] = score_df['총점'] / 3
score_df

        국어  영어  과학   총점         평균
1학년 1반  60  83  31  174  58.000000
    2반   6  95  92  193  64.333333
    3반  60   5  37  102  34.000000
    4반  62  52  31  145  48.333333
    5반  27   3  89  119  39.666667
2학년 1반  80  20  96  196  65.333333
    2반  12  26  12   50  16.666667
    3반   6  36  96  138  46.000000
    4반  87  99  37  223  74.333333
    5반  13  82  85  180  60.000000
3학년 1반  19  91   7  117  39.000000
    2반  73   8  79  160  53.333333
    3반  54  62  85  201  67.000000
    4반  80  60  53  193  64.333333
    5반  58  69  37  164  54.666667

In [35]:
# 인덱스명 추가
score_df.index.names = ['학년', '반']
score_df

        국어  영어  과학   총점         평균
학년  반
1학년 1반  60  83  31  174  58.000000
    2반   6  95  92  193  64.333333
    3반  60   5  37  102  34.000000
    4반  62  52  31  145  48.333333
    5반  27   3  89  119  39.666667
2학년 1반  80  20  96  196  65.333333
    2반  12  26  12   50  16.666667
    3반   6  36  96  138  46.000000
    4반  87  99  37  223  74.333333
    5반  13  82  85  180  60.000000
3학년 1반  19  91   7  117  39.000000
    2반  73   8  79  160  53.333333
    3반  54  62  85  201  67.000000
    4반  80  60  53  193  64.333333
    5반  58  69  37  164  54.666667

In [39]:
# 특정 칼럼만 슬라이싱할 때에는 배열로 넣어줘야한다.
score_df.groupby('학년').sum()[ ['국어','영어','과학'] ]

      국어   영어   과학
학년
1학년  215  238  280
2학년  198  263  326
3학년  284  290  261

## 실습3

In [42]:
titanic_df = pd.read_csv('train.csv', index_col=0)

In [43]:
titanic_df.columns

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket',
       'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [44]:
age_mean = titanic_df['Age'].mean()
age_mean

29.69911764705882

In [46]:
# 방법 1
# titanic_df['Age'] = titanic_df['Age'].fillna(age_mean)

# 방법 2
titanic_df['Age'].fillna(age_mean, inplace=True)

In [48]:
titanic_df['Cabin'].fillna('N', inplace=True)
titanic_df['Embarked'].fillna('N', inplace=True)

In [53]:
titanic_df.groupby('Sex').sum()['Survived']

Sex
female    233
male      109
Name: Survived, dtype: int64

In [55]:
titanic_df.groupby('Pclass').sum()['Survived']

Pclass
1    136
2     87
3    119
Name: Survived, dtype: int64

In [63]:
def change_age(age):
    age = int(age)
    if age >= 70:
        return '노인'
    elif age >= 10:
        return str(age//10) + '0대'
    else:
        return '유아'

In [66]:
titanic_df['AgeRange'] = titanic_df['Age'].apply(change_age)

In [74]:
titanic_df.groupby('AgeRange').sum()['Survived']

AgeRange
10대     41
20대    129
30대     73
40대     34
50대     20
60대      6
노인       1
유아      38
Name: Survived, dtype: int64